# 라이브러리 import

In [66]:
import pandas as pd
import numpy as np

import pymysql as mysql
from sqlalchemy import create_engine

mysql.install_as_MySQLdb()
import MySQLdb

# MySQL 연결 설정

In [67]:
engine = create_engine("mysql+mysqldb://capstone:"+"zoqtmxhs"+"@114.70.93.123:11081/demand_prediction", encoding='utf-8')

In [68]:
conn = engine.connect()

d:\users\wjdgu\anaconda3\envs\tf\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

# 데이터 로드

In [69]:
data_path = './data/'

In [70]:
sale_2016 = pd.read_csv(data_path + 'train_2016.csv')
sale_2016['date'] = pd.to_datetime(sale_2016['date'], format='%Y-%m-%d')

In [71]:
sale_2016

               date  store_nbr  item_nbr  unit_sales
0        2016-01-01         25    105574        12.0
1        2016-01-01         25    105575         9.0
2        2016-01-01         25    105857         3.0
3        2016-01-01         25    108634         3.0
4        2016-01-01         25    108701         2.0
...             ...        ...       ...         ...
35229866 2016-12-31         54   2048381         6.0
35229867 2016-12-31         54   2048421         4.0
35229868 2016-12-31         54   2048471        10.0
35229869 2016-12-31         54   2048515         3.0
35229870 2016-12-31         54   2048674         1.0

[35229871 rows x 4 columns]

# 데이터 수정

In [72]:
df = sale_2016.copy()

In [73]:
df.rename(columns={'date':'sale_date', 'unit_sales': 'sale_count', 'store_nbr': 'shop_id', 'item_nbr': 'item_id'}, inplace=True)

In [74]:
df['sale_id'] = df.index

In [75]:
df = df[['sale_id', 'sale_date', 'shop_id', 'item_id', 'sale_count']]
df

           sale_id  sale_date  shop_id  item_id  sale_count
0                0 2016-01-01       25   105574        12.0
1                1 2016-01-01       25   105575         9.0
2                2 2016-01-01       25   105857         3.0
3                3 2016-01-01       25   108634         3.0
4                4 2016-01-01       25   108701         2.0
...            ...        ...      ...      ...         ...
35229866  35229866 2016-12-31       54  2048381         6.0
35229867  35229867 2016-12-31       54  2048421         4.0
35229868  35229868 2016-12-31       54  2048471        10.0
35229869  35229869 2016-12-31       54  2048515         3.0
35229870  35229870 2016-12-31       54  2048674         1.0

[35229871 rows x 5 columns]

# 판매점, 아이템 별로 그룹 보기

In [76]:
stat = df.groupby(['shop_id', 'item_id']).count()

In [77]:
stat

                 sale_id  sale_date  sale_count
shop_id item_id
1       99197         33         33          33
        103520       190        190         190
        103665       285        285         285
        105574       330        330         330
        105575       362        362         362
...                  ...        ...         ...
54      2081064        1          1           1
        2081095        1          1           1
        2089339        1          1           1
        2105347        1          1           1
        2124052        1          1           1

[158778 rows x 3 columns]

# 한 판매점, 한 아이템 데이터 추출

In [78]:
data = df.copy()

In [79]:
shop_id = 25
item_id = 105574

In [80]:
data = data[data['shop_id'] == shop_id]
data = data[data['item_id'] == item_id]

In [81]:
data

           sale_id  sale_date  shop_id  item_id  sale_count
0                0 2016-01-01       25   105574        12.0
46607        46607 2016-01-02       25   105574        16.0
147190      147190 2016-01-03       25   105574         9.0
246245      246245 2016-01-04       25   105574         4.0
341760      341760 2016-01-05       25   105574         6.0
...            ...        ...      ...      ...         ...
34738111  34738111 2016-12-27       25   105574         8.0
34842774  34842774 2016-12-28       25   105574         1.0
34949141  34949141 2016-12-29       25   105574        16.0
35056945  35056945 2016-12-30       25   105574        12.0
35167211  35167211 2016-12-31       25   105574         7.0

[281 rows x 5 columns]

# DB에 저장

In [ ]:
df.to_sql(name='sales', con=engine, if_exists='append', index=False)